//1.გამოაცხადეთ ცვლადი "userInput" რომელსაც მიანიჭებთ მხოლოდ „number"-სა და „string"-ს.
//შექმენით ფუნქცია processinput(), რომელიც მიიღებს user input -ს.
//თუ user input რიცხვია, კონსოლში გამოვიტანოთ ლუწია თუ არა.
//b. თუ სტრინგი, მაშინ მისი სიგრძე

let userInput: number | string = 1;

function processinput(userInput: string | number) {
  if (typeof userInput === "number") {
    console.log(userInput % 2 === 0 ? "ლუწი" : "კენტი");
  } else {
    console.log(userInput.length);
  }
}

// processinput(userInput);

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//2. დაწერეთ ფუნქცია, რომელიც მიიღებს რიცხვების მასივს, გამოთვლის ელემენტების ჯამს და დააბრუნებს ამ მნიშვნელობას.

let numbers: number[] = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

function sumNumbers(numbers: number[]) {
  let sum = 0;
  numbers.forEach((x) => (sum += x));

  return sum;
}
console.log(sumNumbers(numbers));

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//3.შექმენით ფუნქცია, რომელიც გამოგითვლით მარკუთხედისა ან კვადრატის პერიმეტრს. თუ გადასცემთ ორ პარამეტერს, გამოთვალოს მარკუთხედის პერიმეტრი, ერთის შემთხვევაში კი კვადრატის.
//კლასები - შეეცადეთ ინტერფეისები და კლასები ცალკე ფაილებად დაყოთ, როგორც სემინარზე

function calcPer(x: number, y?: number): number | undefined {
  if (x > 0 && y !== undefined && y > 0) {
    return 2 * x + 2 * y;
  } else if (x > 0 && y === undefined) {
    return 4 * x;
  }
  return undefined;
}

console.log(calcPer(2, 5));

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//4.
